# Module 5  Data Cleaning And Preparation

In [1]:
import pandas as pd
import numpy as np

## Lecture 1

## Handling null values

### None: Non Pythonic Missing data

In [9]:
val1 =np.array([1,3,None,4])
val1

array([1, 3, None, 4], dtype=object)

In [4]:
#val1.sum() cannot be perform because of Null

### NaN: Missing numerical data

In [14]:
val2 =np.array([1,3,np.nan,4])
val2.dtype

dtype('float64')

In [15]:
val2

array([ 1.,  3., nan,  4.])

In [16]:
1+np.nan

nan

In [17]:
0*np.nan

nan

In [21]:
np.nansum(val2),np.nanmin(val2),np.nanmax(val2)

(8.0, 1.0, 4.0)

### NaN and None with Pandas

In [23]:
pd.Series([1,None,5,np.nan])

0    1.0
1    NaN
2    5.0
3    NaN
dtype: float64

In [24]:
data= pd.read_csv("D:/DATASETS/titanic/train.csv")
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Operations

### 1- isnull()

In [26]:
data.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [27]:
data.Age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [31]:
data.Age.isnull().sum()

177

### 2-notnull()

In [29]:
data.Age.notnull()

0       True
1       True
2       True
3       True
4       True
       ...
886     True
887     True
888    False
889     True
890     True
Name: Age, Length: 891, dtype: bool

In [33]:
data.Age[data.Age.notnull()]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: Age, Length: 714, dtype: float64

In [34]:
df = pd.DataFrame({
     "A":[1,2,3,None],
     "B":['#Na',12,3,5],
     "C":[11,22,34,'no val'],
     "D":['No',2,np.nan,44],
     "E":['n/a',2,3,None],
})

In [36]:
df.to_csv('clean_me.csv')

In [40]:
df= pd.read_csv("clean_me.csv",index_col=[0])
df

     A    B       C    D    E
0  1.0  #Na      11   No  NaN
1  2.0   12      22    2  2.0
2  3.0    3      34  NaN  3.0
3  NaN    5  no val   44  NaN

In [44]:
df= pd.read_csv("clean_me.csv",index_col=[0],na_values=['#Na','no val','No'])
df

     A     B     C     D    E
0  1.0   NaN  11.0   NaN  NaN
1  2.0  12.0  22.0   2.0  2.0
2  3.0   3.0  34.0   NaN  3.0
3  NaN   5.0   NaN  44.0  NaN

In [45]:
df.isnull().sum()

A    1
B    1
C    1
D    2
E    2
dtype: int64